        01 TRAN-REC.
			05 I-CAMPGROUND		PIC X(25).
			05 I-SITE			PIC X99.
			05 I-DATE			PIC 9(8).
			05 I-LEN-STAY		PIC 99.
			05 I-LNAME			PIC X(20).
			05 I-FNAME			PIC X(20).
			05 I-AMT			PIC S9(3)V99.
			05 I-CCTYPE			PIC X.
			05 I-CCNUM			PIC 9(16).
			05 I-CCEXP			PIC 9(8).
